In [3]:
from pandas import DataFrame
df=DataFrame([
             [19,14,18,19],
             [18,10,17,16],
             [17,16,18,15]
             ],
    columns=['OSA','JAVA','SE','DS']


            )
df

   OSA  JAVA  SE  DS
0   19    14  18  19
1   18    10  17  16
2   17    16  18  15

In [4]:
df.sum()

OSA     54
JAVA    40
SE      53
DS      50
dtype: int64

In [5]:
df.max()

OSA     19
JAVA    16
SE      18
DS      19
dtype: int64

In [6]:
df.mean()

OSA     18.000000
JAVA    13.333333
SE      17.666667
DS      16.666667
dtype: float64

In [7]:
df.min()

OSA     17
JAVA    10
SE      17
DS      15
dtype: int64

In [8]:
df.count()

OSA     3
JAVA    3
SE      3
DS      3
dtype: int64

In [9]:
df.size()

TypeError: 'numpy.int32' object is not callable

In [10]:
df.first()

TypeError: first() missing 1 required positional argument: 'offset'

In [11]:
df.describe()

        OSA       JAVA         SE         DS
count   3.0   3.000000   3.000000   3.000000
mean   18.0  13.333333  17.666667  16.666667
std     1.0   3.055050   0.577350   2.081666
min    17.0  10.000000  17.000000  15.000000
25%    17.5  12.000000  17.500000  15.500000
50%    18.0  14.000000  18.000000  16.000000
75%    18.5  15.000000  18.000000  17.500000
max    19.0  16.000000  18.000000  19.000000

In [13]:
df.agg(['sum','max','min','std'])

      OSA      JAVA        SE         DS
sum  54.0  40.00000  53.00000  50.000000
max  19.0  16.00000  18.00000  19.000000
min  17.0  10.00000  17.00000  15.000000
std   1.0   3.05505   0.57735   2.081666

In [14]:
df.prod()

OSA     5814
JAVA    2240
SE      5508
DS      4560
dtype: int64

In [25]:
from pandas import DataFrame
df1=DataFrame([
                 ['Aryan','singh','full time','administration',2,20000],
                 ['rohan','agarwal','intern','technical',3,5000],
                 ['riya','shah','full time','administration',5,10000],
                 ['yash','bhatia','part time','technical',7,10000],
                 ['sidhant','khanna','full time','management',6,20000],
                ]
    ,columns=['first name','last name','type','department','YoE','salary']



                )
df1

  first name last name       type      department  YoE  salary
0      Aryan     singh  full time  administration    2   20000
1      rohan   agarwal     intern       technical    3    5000
2       riya      shah  full time  administration    5   10000
3       yash    bhatia  part time       technical    7   10000
4    sidhant    khanna  full time      management    6   20000

In [21]:
df1.groupby(['type']).sum()

           YoE  salary
type
full time   13   50000
intern       3    5000
part time    7   10000

In [22]:
df1.groupby(['type']).mean()

                YoE        salary
type
full time  4.333333  16666.666667
intern     3.000000   5000.000000
part time  7.000000  10000.000000

In [26]:
df1.groupby(['type','department']).sum()

                          YoE  salary
type      department
full time administration    7   30000
          management        6   20000
intern    technical         3    5000
part time technical         7   10000

In [27]:
df1.groupby(['department','type']).sum()

                          YoE  salary
department     type
administration full time    7   30000
management     full time    6   20000
technical      intern       3    5000
               part time    7   10000